In [60]:
import numpy as np
import pandas as pd
import datetime

import matplotlib
import matplotlib.pyplot as plt

In [61]:
df_account=pd.read_csv('account.asc', sep=';')
df_card=pd.read_csv('card.asc', sep=';')
df_client=pd.read_csv('client.asc', sep=';')
df_disp=pd.read_csv('disp.asc', sep=';')
df_district=pd.read_csv('district.asc', sep=';')
df_loan=pd.read_csv('loan.asc', sep=';')
df_order=pd.read_csv('order.asc', sep=';')
df_trans=pd.read_csv('trans.asc', sep=';')

C:\ISCTE3\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [62]:
print(df_card.head())
print(df_client.head())
print(df_disp.head())
print(df_district.head())
print(df_loan.head())
print(df_order.head())
print(df_trans.head())

   card_id  disp_id     type           issued
0     1005     9285  classic  931107 00:00:00
1      104      588  classic  940119 00:00:00
2      747     4915  classic  940205 00:00:00
3       70      439  classic  940208 00:00:00
4      577     3687  classic  940215 00:00:00
   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5
   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT
   A1           A2               A3       A4  A5  A6  A7  A8  A9    A10  \
0   1  Hl.m. Praha           Prague  1204953   0   0   0   1   1  100.0
1   2      Benesov  central Bohemia    88884  80  26   6   2   5   46.7
2   3       Beroun  central Bohemia    75232  55  26   4   1   5   41.7
3   4       Kladno  central Bohemia   149893  63  29   6   2   6   67.4
4   5        Kolin  central Bohemia    95616  65  30   4   1   6   51.4

     A11   A12   A13  A14    A15    A16
0  12541  0.29  0.43  167  85677  99107
1   8507  1.67  1.85  132   2159   2674
2   8980  1.95  2.21  111   2824   2813
3   9753  4.64  5.05  109   5244   5892
4   9307  3.85  4.43  118   2616   3040
   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12    8033.0      B
1     5316        1801  930711  165960        36    4610.0      A
2     6863        9188  930728  127080        60    2118.0      A
3     5325        1843  930803  105804        36    2939.0      A
4     7240       11013  930906  274740        60    4579.0      A
   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0
   trans_id  account_id    date    type operation  amount  balance k_symbol  \
0    695247        2378  930101  PRIJEM     VKLAD   700.0    700.0      NaN
1    171812         576  930101  PRIJEM     VKLAD   900.0    900.0      NaN
2    207264         704  930101  PRIJEM     VKLAD  1000.0   1000.0      NaN
3   1117247        3818  930101  PRIJEM     VKLAD   600.0    600.0      NaN
4    579373        1972  930102  PRIJEM     VKLAD   400.0    400.0      NaN

  bank  account
0  NaN      NaN
1  NaN      NaN
2  NaN      NaN
3  NaN      NaN
4  NaN      NaN

In [63]:
df_trans.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN

In [64]:
df_trans.dtypes

trans_id        int64
account_id      int64
date            int64
type           object
operation      object
amount        float64
balance       float64
k_symbol       object
bank           object
account       float64
dtype: object

In [65]:
#"PRIJEM" stands for credit
#"VYDAJ" stands for withdrawal

print(df_trans['type'].value_counts())
aux = df_trans[(df_trans.type == 'VYDAJ')& (df_trans.operation == 'VYBER')]
print(aux.type.count())
print(aux.head(40))
###vyber type is the same as withdrawl

VYDAJ     634571
PRIJEM    405083
VYBER      16666
Name: type, dtype: int64
418252
     trans_id  account_id    date   type operation   amount  balance k_symbol  \
136    695560        2378  930131  VYDAJ     VYBER  34700.0  59453.7      NaN
189    145127         485  930203  VYDAJ     VYBER  25300.0  46177.9      NaN
222   1028004        3510  930206  VYDAJ     VYBER   1600.0  22271.0      NaN
249    622121        2122  930207  VYDAJ     VYBER  14100.0  32859.1      NaN
267    110785         374  930208  VYDAJ     VYBER   1500.0  21941.0      NaN
293    393999        1338  930210  VYDAJ     VYBER   5200.0  33215.5      NaN
301    695561        2378  930211  VYDAJ     VYBER  25200.0  85871.7      NaN
309    615783        2099  930211  VYDAJ     VYBER  29700.0  52262.4      NaN
324   1101121        3760  930212  VYDAJ     VYBER  14400.0  36059.2      NaN
331   1549098        5270  930212  VYDAJ     VYBER   9600.0  36059.2      NaN
348   1143204        3909  930213  VYDAJ     VYBER    500.0  24600.0      NaN
393     64021         212  930219  VYDAJ     VYBER  14800.0  34990.0      NaN
398    695562        2378  930220  VYDAJ     VYBER  33900.0  71107.7      NaN
400    136148         456  930220  VYDAJ     VYBER  10500.0  38031.0      NaN
402    227105         772  930220  VYDAJ     VYBER    600.0  23909.0      NaN
422   1313408        4484  930223  VYDAJ     VYBER  62100.0  41183.0      NaN
426   1486385        5065  930223  VYDAJ     VYBER   4000.0  29345.0      NaN
428   1736950        5891  930224  VYDAJ     VYBER   4500.0  28994.0      NaN
433    292547        1000  930224  VYDAJ     VYBER   1500.0  30048.0      NaN
435    511638        1750  930225  VYDAJ     VYBER   2500.0  23463.0      NaN
441   1911147        6473  930225  VYDAJ     VYBER   8900.0  36168.0      NaN
443    783618        2670  930226  VYDAJ     VYBER   1400.0  24081.0      NaN
465    695490        2378  930228  VYDAJ     VYBER     14.6  71437.8   SLUZBY
576    695563        2378  930302  VYDAJ     VYBER  21400.0  50037.8      NaN
579    207643         704  930302  VYDAJ     VYBER   8900.0  30093.3      NaN
580   1117692        3818  930302  VYDAJ     VYBER   4200.0  33271.2      NaN
587    771485        2632  930303  VYDAJ     VYBER   6900.0  27997.3      NaN
590    453139        1539  930304  VYDAJ     VYBER  13400.0  42987.6      NaN
591    145022         485  930304  VYDAJ     VYBER   8100.0  76843.9      NaN
594    726267        2484  930304  VYDAJ     VYBER   8100.0  28218.3      NaN
601    505751        1726  930304  VYDAJ     VYBER   3200.0  31882.2      NaN
602    251559         862  930304  VYDAJ     VYBER  10700.0  33972.2      NaN
605    332727        1132  930305  VYDAJ     VYBER  11800.0  37444.1      NaN
606    145128         485  930305  VYDAJ     VYBER  25300.0  51543.9      NaN
614   1313409        4484  930305  VYDAJ     VYBER   8900.0  32352.9      NaN
648   1163704        3983  930306  VYDAJ     VYBER    200.0  30005.1      NaN
649   2798252        9265  930306  VYDAJ     VYBER  19000.0  47012.9      NaN
656    192367         652  930306  VYDAJ     VYBER   4800.0  26657.6      NaN
701   1028005        3510  930308  VYDAJ     VYBER    300.0  22070.3      NaN
703    375033        1276  930308  VYDAJ     VYBER   2200.0  29229.4      NaN

    bank  account
136  NaN      NaN
189  NaN      NaN
222  NaN      NaN
249  NaN      NaN
267  NaN      NaN
293  NaN      NaN
301  NaN      NaN
309  NaN      NaN
324  NaN      NaN
331  NaN      NaN
348  NaN      NaN
393  NaN      NaN
398  NaN      NaN
400  NaN      NaN
402  NaN      NaN
422  NaN      NaN
426  NaN      NaN
428  NaN      NaN
433  NaN      NaN
435  NaN      NaN
441  NaN      NaN
443  NaN      NaN
465  NaN      NaN
576  NaN      NaN
579  NaN      NaN
580  NaN      NaN
587  NaN      NaN
590  NaN      NaN
591  NaN      NaN
594  NaN      NaN
601  NaN      NaN
602  NaN      NaN
605  NaN      NaN
606  NaN      NaN
614  NaN      NaN
648  NaN      NaN
649  NaN      NaN
656  NaN      NaN
701  NaN      NaN
703  NaN      NaN

In [66]:
def change_type(Ttype):
    if (Ttype == 'PRIJEM'):
        return 'CREDIT'
    else:
        return 'WITHDRAWAL'
df_trans['type']= df_trans['type'].map(change_type)

In [67]:
df_trans['operation'].value_counts()

VYBER             434918
PREVOD NA UCET    208283
VKLAD             156743
PREVOD Z UCTU      65226
VYBER KARTOU        8036
Name: operation, dtype: int64

In [68]:
'''
"VYBER KARTOU" credit card withdrawal
"VKLAD" credit in cash
"PREVOD Z UCTU" collection from another bank
"VYBER" withdrawal in cash
"PREVOD NA UCET" remittance to another bank
'''
def change_op(operation):
    if(operation == 'VYBER KARTOU'):
        return 'credit_card_withd'
    elif(operation == 'VKLAD'):
        return 'credit_cash'
    elif(operation == 'VYBER'):
        return 'withd_cash'
    elif(operation == 'PREVOD Z UCTU'):
        return 'collection_from_other_bank'
    else:
        return 'remittance_other_bank'

In [69]:
df_trans['operation']=df_trans['operation'].map(change_op)
print(df_trans.head(5))

   trans_id  account_id    date    type    operation  amount  balance  \
0    695247        2378  930101  CREDIT  credit_cash   700.0    700.0
1    171812         576  930101  CREDIT  credit_cash   900.0    900.0
2    207264         704  930101  CREDIT  credit_cash  1000.0   1000.0
3   1117247        3818  930101  CREDIT  credit_cash   600.0    600.0
4    579373        1972  930102  CREDIT  credit_cash   400.0    400.0

  k_symbol bank  account
0      NaN  NaN      NaN
1      NaN  NaN      NaN
2      NaN  NaN      NaN
3      NaN  NaN      NaN
4      NaN  NaN      NaN

In [70]:
df_trans['k_symbol'].value_counts()

UROK           183114
SLUZBY         155832
SIPO           118065
                53433
DUCHOD          30338
POJISTNE        18500
UVER            13580
SANKC. UROK      1577
Name: k_symbol, dtype: int64

In [71]:
aux = df_trans[(df_trans.k_symbol !='UROK')&(df_trans.k_symbol !='SLUBZY')&(df_trans.k_symbol !='SIPO')&(df_trans.k_symbol !='DUCHOD')&(df_trans.k_symbol !='POJISTNE')&(df_trans.k_symbol !='UVER')&(df_trans.k_symbol !='SANKC. UROK')]
print(aux)

         trans_id  account_id    date        type          operation  amount  \
0          695247        2378  930101      CREDIT        credit_cash   700.0
1          171812         576  930101      CREDIT        credit_cash   900.0
2          207264         704  930101      CREDIT        credit_cash  1000.0
3         1117247        3818  930101      CREDIT        credit_cash   600.0
4          579373        1972  930102      CREDIT        credit_cash   400.0
...           ...         ...     ...         ...                ...     ...
1051814    606211        2063  981230  WITHDRAWAL  credit_card_withd  1400.0
1051815    606741        2065  981230  WITHDRAWAL         withd_cash  4640.0
1051816    713704        2439  981230  WITHDRAWAL         withd_cash   250.0
1051817    713387        2437  981230  WITHDRAWAL         withd_cash  1470.0
1051818    492431        1679  981230  WITHDRAWAL         withd_cash   840.0

         balance k_symbol bank  account
0          700.0      NaN  NaN      NaN
1          900.0      NaN  NaN      NaN
2         1000.0      NaN  NaN      NaN
3          600.0      NaN  NaN      NaN
4          400.0      NaN  NaN      NaN
...          ...      ...  ...      ...
1051814  39969.3      NaN  NaN      0.0
1051815  16339.0      NaN  NaN      NaN
1051816  20890.7      NaN  NaN      NaN
1051817  17101.3      NaN  NaN      NaN
1051818  50193.8      NaN  NaN      NaN

[691146 rows x 10 columns]

In [72]:
'''
	"POJISTNE" stands for insurrance payment
"SLUZBY" stands for payment for statement
"UROK" stands for interest credited
"SANKC. UROK" sanction interest if negative balance
"SIPO" stands for household
"DUCHOD" stands for old-age pension
"UVER" stands for loan payment
'''
def change_k(k):
    if(k == 'POJISTNE'):
        return 'insurrance_payment'
    elif(k == 'SLUZBY'):
        return 'payment_for_statement'
    elif(k == 'UROK'):
        return 'interest_credited'
    elif(k == 'SANKC. UROK'):
        return 'sanction_negative_balance'
    elif(k == 'SIPO'):
        return 'household'
    elif(k == 'DUCHOD'):
        return 'old-age_pension'
    elif(k == 'UVER'):
        return 'loan_payment'
    else:
        return 'UNKNOWN'

In [73]:
df_trans['k_symbol']=df_trans['k_symbol'].map(change_k)

In [74]:
df_trans.head(20)

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,CREDIT,credit_cash,700.0,700.0,UNKNOWN,NaN,NaN
1,171812,576,930101,CREDIT,credit_cash,900.0,900.0,UNKNOWN,NaN,NaN
2,207264,704,930101,CREDIT,credit_cash,1000.0,1000.0,UNKNOWN,NaN,NaN
3,1117247,3818,930101,CREDIT,credit_cash,600.0,600.0,UNKNOWN,NaN,NaN
4,579373,1972,930102,CREDIT,credit_cash,400.0,400.0,UNKNOWN,NaN,NaN
5,771035,2632,930102,CREDIT,credit_cash,1100.0,1100.0,UNKNOWN,NaN,NaN
6,452728,1539,930103,CREDIT,credit_cash,600.0,600.0,UNKNOWN,NaN,NaN
7,725751,2484,930103,CREDIT,credit_cash,1100.0,1100.0,UNKNOWN,NaN,NaN
8,497211,1695,930103,CREDIT,credit_cash,200.0,200.0,UNKNOWN,NaN,NaN
9,232960,793,930103,CREDIT,credit_cash,800.0,800.0,UNKNOWN,NaN,NaN
10,505240,1726,930103,CREDIT,credit_cash,1000.0,1000.0,UNKNOWN,NaN,NaN
11,144541,485,930104,CREDIT,credit_cash,300.0,300.0,UNKNOWN,NaN,NaN
12,637741,2177,930104,CREDIT,credit_cash,800.0,800.0,UNKNOWN,NaN,NaN
13,689827,2357,930104,CREDIT,credit_cash,800.0,800.0,UNKNOWN,NaN,NaN
14,846006,2881,930104,CREDIT,credit_cash,700.0,700.0,UNKNOWN,NaN,NaN
15,637742,2177,930105,CREDIT,collection_from_other_bank,5123.0,5923.0,old-age_pension,YZ,62457513.0
16,2908688,9635,930105,CREDIT,credit_cash,400.0,400.0,UNKNOWN,NaN,NaN
17,232961,793,930105,CREDIT,collection_from_other_bank,3401.0,4201.0,UNKNOWN,IJ,6149286.0
18,192096,652,930105,CREDIT,credit_cash,700.0,700.0,UNKNOWN,NaN,NaN
19,542215,1844,930106,CREDIT,credit_cash,500.0,500.0,UNKNOWN,NaN,NaN

In [75]:
df_account.head(10)

   account_id  district_id           frequency    date
0         576           55    POPLATEK MESICNE  930101
1        3818           74    POPLATEK MESICNE  930101
2         704           55    POPLATEK MESICNE  930101
3        2378           16    POPLATEK MESICNE  930101
4        2632           24    POPLATEK MESICNE  930102
5        1972           77    POPLATEK MESICNE  930102
6        1539            1  POPLATEK PO OBRATU  930103
7         793           47    POPLATEK MESICNE  930103
8        2484           74    POPLATEK MESICNE  930103
9        1695           76    POPLATEK MESICNE  930103

In [76]:
df_account.frequency.value_counts()

POPLATEK MESICNE      4167
POPLATEK TYDNE         240
POPLATEK PO OBRATU      93
Name: frequency, dtype: int64

In [77]:
'''
"POPLATEK MESICNE" stands for monthly issuance
"POPLATEK TYDNE" stands for weekly issuance
"POPLATEK PO OBRATU" stands for issuance after transaction
'''

def change_freq(freq):
    if(freq=='POPLATEK MESICNE'):
        return 'monthly'
    if(freq=='POPLATEK TYDNE'):
        return 'weekly'
    else:
        return 'after_trasaction'

In [79]:
df_account['frequency'] = df_account['frequency'].map(change_freq)
df_account= df_account.rename(columns={"frequency": "issuance_frequency"}) 
df_account.head(10)

   account_id  district_id issuance_frequency    date
0         576           55            monthly  930101
1        3818           74            monthly  930101
2         704           55            monthly  930101
3        2378           16            monthly  930101
4        2632           24            monthly  930102
5        1972           77            monthly  930102
6        1539            1   after_trasaction  930103
7         793           47            monthly  930103
8        2484           74            monthly  930103
9        1695           76            monthly  930103